In [40]:
#groupby method

In [41]:
import pandas as pd
import numpy as np

In [42]:
# salaryData={"department":["software","software","marketing","marketing","law","law"],
#             "worker name": ["ahmet","mehmet","atil","burak","zeynep","fatma"],
#             "salaries":[100,150,200,300,400,500]
#             }

list1=["software","software","software","hardware","hardware"]
list2=["hediye","sila","kubra","ali","mehmet"]
zippedList=list(zip(list1,list2))
multiIndex=pd.MultiIndex.from_tuples(zippedList)


salaryData={"salaries":[25,30,35,32,21],
            "work hours":[7,6,5,7,6]}

df=pd.DataFrame(salaryData,index=multiIndex,columns=["salaries","work hours"])
df

                 salaries  work hours
software hediye        25           7
         sila          30           6
         kubra         35           5
hardware ali           32           7
         mehmet        21           6

In [43]:
#şimdi multiindex yerine groupby kullanalım

salaryData={"departments":["software","software","marketing","marketing","law","law"],
            "workers":["ahmet","mehmet","atil","burak","sila","nur"],
            "salaries":[100,130,150,200,300,230]}

df=pd.DataFrame(salaryData)
df

  departments workers  salaries
0    software   ahmet       100
1    software  mehmet       130
2   marketing    atil       150
3   marketing   burak       200
4         law    sila       300
5         law     nur       230

In [49]:
groupObject2=df.groupby("departments")

In [53]:
groupObject2.count()

             workers  salaries
departments
law                2         2
marketing          2         2
software           2         2

In [54]:
groupObject2["salaries"].mean()

departments
law          265.0
marketing    175.0
software     115.0
Name: salaries, dtype: float64

In [55]:
groupObject2.min()

            workers  salaries
departments
law             nur       230
marketing      atil       150
software      ahmet       100

In [56]:
groupObject2.max()

            workers  salaries
departments
law            sila       300
marketing     burak       200
software     mehmet       130

In [57]:
groupObject2.describe()

            salaries
               count   mean        std    min    25%    50%    75%    max
departments
law              2.0  265.0  49.497475  230.0  247.5  265.0  282.5  300.0
marketing        2.0  175.0  35.355339  150.0  162.5  175.0  187.5  200.0
software         2.0  115.0  21.213203  100.0  107.5  115.0  122.5  130.0

In [ ]:
#konuyu daha iyi anlamak icin 1 örnek daha yapalım

data2={"hastalik A":[2000,400,1040],"hastalik B":[800,950,400],"hastalik C":[400,400,500]}

df2=pd.DataFrame(data2,index=["Hastane 1","Hastane 2","Hastane 3"],columns=["hastalik A","hastalik B","hastalik C"])
df2

           hastalik A  hastalik B  hastalik C
Hastane 1        2000         800         400
Hastane 2         400         950         400
Hastane 3        1040         400         500

In [ ]:
groupObject2=df2.groupby("hastalik B")

In [ ]:
#mesela aynı degerlerde olan baska bi deger varsa groupby ile bunların durumuna bakabiliriz
groupObject2.count()

            hastalik A  hastalik C
hastalik B
400                  1           1
800                  1           1
950                  1           1